Cambio de pickle a csv for render

In [1]:
import requests
import pandas as pd

# URLs de los archivos Pickle en GitHub
urls = [
    'https://github.com/Lucaramallo/PI1_MLOps_Sistema_de_Recomendacion_Movies_ML/raw/main/Datasets_Cleaned_light/df_f1_lang_movie_count.pkl',
    'https://github.com/Lucaramallo/PI1_MLOps_Sistema_de_Recomendacion_Movies_ML/raw/main/Datasets_Cleaned_light/df_f2_movies_runtime.pkl',
    'https://github.com/Lucaramallo/PI1_MLOps_Sistema_de_Recomendacion_Movies_ML/raw/main/Datasets_Cleaned_light/df_f3_collection_name_returns.pkl',
    'https://github.com/Lucaramallo/PI1_MLOps_Sistema_de_Recomendacion_Movies_ML/raw/main/Datasets_Cleaned_light/df_f4_production_countrys.pkl',
    'https://github.com/Lucaramallo/PI1_MLOps_Sistema_de_Recomendacion_Movies_ML/raw/main/Datasets_Cleaned_light/df_f5_production_companies_return.pkl',
    'https://github.com/Lucaramallo/PI1_MLOps_Sistema_de_Recomendacion_Movies_ML/raw/main/Datasets_Cleaned_light/df_f6_df_expanded.pkl',
    'https://github.com/Lucaramallo/PI1_MLOps_Sistema_de_Recomendacion_Movies_ML/raw/main/Datasets_Cleaned_light/df_f6_get_director.pkl',
    'https://github.com/Lucaramallo/PI1_MLOps_Sistema_de_Recomendacion_Movies_ML/raw/main/Datasets_Cleaned_light/df_f7_one_hot_genres.pkl'
]

# Descargar y cargar los archivos Pickle
dataframes = []
for url in urls:
    response = requests.get(url)
    with open(url.split('/')[-1], 'wb') as f:
        f.write(response.content)
    dataframe = pd.read_pickle(url.split('/')[-1])
    dataframes.append(dataframe)

# Asignar los DataFrames a las variables correspondientes
df_f1_lang_movie_count, df_f2_movies_runtime, df_f3_collection_name_returns, df_f4_production_countrys, df_f5_production_companies_return, df_f6_df_expanded, df_f6_get_director, df_f7_one_hot_genres = dataframes

# Guardar los DataFrames en archivos CSV con los mismos nombres
df_f1_lang_movie_count.to_csv('../Datasets_Cleaned_light/df_f1_lang_movie_count.csv', index=False, mode ='w')
df_f2_movies_runtime.to_csv('../Datasets_Cleaned_light/df_f2_movies_runtime.csv', index=False, mode ='w')
df_f3_collection_name_returns.to_csv('../Datasets_Cleaned_light/df_f3_collection_name_returns.csv', index=False, mode ='w')
df_f4_production_countrys.to_csv('../Datasets_Cleaned_light/df_f4_production_countrys.csv', index=False, mode ='w')
df_f5_production_companies_return.to_csv('../Datasets_Cleaned_light/df_f5_production_companies_return.csv', index=False, mode ='w')
df_f6_df_expanded.to_csv('../Datasets_Cleaned_light/df_f6_df_expanded.csv', index=False, mode ='w')
df_f6_get_director.to_csv('../Datasets_Cleaned_light/df_f6_get_director.csv', index=False, mode ='w')
df_f7_one_hot_genres.to_csv('../Datasets_Cleaned_light/df_f7_one_hot_genres.csv', index=False, mode ='w')

### algunas revisiones..

In [2]:
df_f1_lang_movie_count.head()

  iso_language_code  count language_name
0                en  30814       english
1                fr   4779        french
2                ja   3516      japanese
3                ru   3126       russian
4                de   3098        german

In [3]:
df_f2_movies_runtime.head()

                         title  runtime  release_year
0                    toy story       81          1995
1                      jumanji      104          1995
2             grumpier old men      101          1995
3            waiting to exhale      127          1995
4  father of the bride part ii      106          1995

In [4]:
df_f3_collection_name_returns.head()

,collection_name,id_list,title_list,return_sum,return_mean
0,... has fallen collection,"[117263, 267860, 117263]","[olympus has fallen, london has fallen, olympu...",8.029973,2.676658
1,00 schneider filmreihe,[1652],[00 schneider - jagd auf nihil baxter],2.653365,2.653365
2,08/15 collection,[19430],[08/15],2.653365,2.653365
3,100 girls collection,"[10035, 20648]","[100 girls, 100 women]",5.306730,2.653365
4,101 dalmatians (animated) collection,"[12230, 13654]","[one hundred and one dalmatians, 101 dalmatian...",56.623368,28.311684

In [5]:
df_f4_production_countrys.head()

              country_names
0  united states of america
1  united states of america
2  united states of america
3  united states of america
4  united states of america

In [11]:
pais = 'argentina'  # Set the country name you want to search for

# Filter out rows with missing values in the 'country_names' column, then use .str.contains()
filtered_df = df_f4_production_countrys.dropna(subset=['country_names'])
count = filtered_df[filtered_df['country_names'].str.contains(pais, case=False)].shape[0]

print("Number of movies produced in", pais, ":", count)

Number of movies produced in argentina : 263

In [ ]:
print(count)

country_names    263
dtype: int64

In [15]:
df_f5_production_companies_return.head(5)

,production_companies_nombres,budget_per_company,revenue_per_company,return_per_company,count_movies
0,"""dia"" productions gmbh & co. kg",9.000000e+06,1.108773e+07,0.307993,1
1,# andrea sperling productions,1.250000e+06,5.604674e+06,2.241870,1
2,# lexyn productions,1.408193e+06,3.736449e+06,0.884455,1
3,'a' production committee,8.449158e+06,2.241870e+07,5.306730,2
4,(?)?????,5.000000e+06,1.120935e+07,2.241870,1

In [ ]:
df_f6_df_expanded.head()

,release_date,title,budget,revenue,return
0,1995-10-30,toy story,3.000000e+07,373554033,12.451801
1,1995-12-15,jumanji,6.500000e+07,262797249,4.043035
2,1995-12-22,grumpier old men,4.224579e+06,11209348,2.653365
3,1995-12-22,waiting to exhale,1.600000e+07,81452156,5.090760
4,1995-02-10,father of the bride part ii,4.224579e+06,76578911,18.126993

In [ ]:
df_f6_get_director.head()

,directors_names,director_budget,director_revenue,director_return,title,release_date,budget,revenue,return
0,dale trevillion\t,1.372458e+07,22418696.0,3.833296,"[walkout, the three stooges]","[2006-03-18 00:00:00, 2000-04-24 00:00:00]",1.372458e+07,22418696,3.833296
1,davide manuli,4.224579e+06,11209348.0,2.653365,[which way is the front line from here? the li...,[2013-01-20 00:00:00],4.224579e+06,11209348,2.653365
2,e.w. swackhamer,8.449158e+06,22418696.0,5.306730,"[eastern boys, eastern boys]","[2013-04-02 00:00:00, 2013-04-02 00:00:00]",8.449158e+06,22418696,5.306730
3,vitaliy vorobyov,8.449158e+06,22418696.0,5.306730,"[fb: fighting beat, fb: fighting beat]","[2007-01-01 00:00:00, 2007-01-01 00:00:00]",8.449158e+06,22418696,5.306730
4,yeon sang-ho,2.534747e+07,67256088.0,15.920189,"[embracing, the three men of melita zganjer, t...","[1992-01-01 00:00:00, 1998-01-01 00:00:00, 201...",2.534747e+07,67256088,15.920189

In [ ]:
df_f7_one_hot_genres.head()

,title,action,adventure,animation,aniplex,brosta tv,carousel productions,comedy,crime,documentary,...,romance,science fiction,sentai filmworks,telescene film group productions,the cartel,thriller,tv movie,vision view entertainment,war,western
0,!women art revolution,0.0,0.0,0.0,0,0,0,0.0000,0.0,0.1630,...,0.0,0.0,0,0,0,0.0000,0.0,0,0.0,0.0000
1,#1 cheerleader camp,0.0,0.0,0.0,0,0,0,0.1311,0.0,0.0000,...,0.0,0.0,0,0,0,0.0000,0.0,0,0.0,0.0000
2,#chicagogirl,0.0,0.0,0.0,0,0,0,0.0000,0.0,0.2627,...,0.0,0.0,0,0,0,0.0000,0.0,0,0.0,0.0000
3,#horror,0.0,0.0,0.0,0,0,0,0.0000,0.0,0.0000,...,0.0,0.0,0,0,0,0.1358,0.0,0,0.0,0.0000
4,"$1,000 on the black",0.0,0.0,0.0,0,0,0,0.0000,0.0,0.0000,...,0.0,0.0,0,0,0,0.0000,0.0,0,0.0,0.2262